       IDENTIFICATION DIVISION.
       PROGRAM-ID.           AS20.
       AUTHOR.               ALBERT.
       INSTALLATION.         LINUX. 
       DATE-WRITTEN.         02/12/2024.
       SECURITY.             CONFIDENTIAL.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-3083.
       OBJECT-COMPUTER. IBM-3083.
       INPUT-OUTPUT SECTION.
           SELECT EMPLEADOS ASSIGN TO UT-S-EMPLEADO.
